# EDA

In [ ]:
import pandas as pd
import numpy as np

In [2]:
item_categories = pd.read_csv('item_categories.csv')

In [3]:
item_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [4]:
items = pd.read_csv('items.csv')

In [5]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [6]:
sales_train = pd.read_csv('sales_train.csv')

In [7]:
sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [8]:
shops = pd.read_csv('shops.csv')

In [9]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [10]:
test = pd.read_csv('test.csv')

In [11]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [28]:
test.groupby('shop_id')

In [32]:
df = sales_train.copy()

df['date'] = df['date'].apply(lambda x: x[-4:]+x[3:5]+x[:2])
df['date'] = pd.to_datetime(df['date'])
df = pd.merge(df, test, how='left', on=['shop_id', 'item_id'])
df.dropna(axis=0, inplace=True)
df['ID'] = df['ID'].astype('int')

In [33]:
df.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,ID
0,2013-01-02,0,59,22154,999.0,1.0,150983
10,2013-01-03,0,25,2574,399.0,2.0,56520
11,2013-01-05,0,25,2574,399.0,1.0,56520
12,2013-01-07,0,25,2574,399.0,1.0,56520
13,2013-01-08,0,25,2574,399.0,2.0,56520

#

In [34]:
df[df['item_id'] == 2574]['item_price'].value_counts()

399.00    1615
449.00     248
282.00       3
398.50       2
379.00       2
398.90       1
319.00       1
302.45       1
378.70       1
378.75       1
398.70       1
398.95       1
330.00       1
378.90       1
378.45       1
Name: item_price, dtype: int64